//public class week5 {
///*
//연산자 우선순위
//    복합 연산 수식
//        Ex)
//            2 + 3 * 4 * 2 => (2 + ((3 * 4) * 5)
//            2 + 3 + 4 + 5 => (((2 + 3) + 4) + 5)
//        -Precedence (우선순위)
//            1차식 (   ) | ->
//            단항        | <-
//            이항        | ->
//                사칙
//                    - 승제
//                    - 가감
//                관계
//                    - 대소
//                    - 동등
//                논리
//                    - 논리 곱
//                    - 논리 합
//            삼항        | <-
//            대입연산자   | <-
//            컴마연산자   | <-
//
//        -Associativity (결합규칙)
//*/
//}
