//public class week_6 {
//    public static void main(String[] args) {
//
//    }
//}
///**
// *  [지난시간 복슴]  ***********************************
// * 1차식 ( → )
// * 단항연산자 ( ← )
// * 이항연산자 ( → )
// *  - 사칙 (승제 > 가감)
// *  - 관계 (대소 > 동등)
// *  - 논리 ( && > ||)
// *
// * 삼항연산자 (조건연산자) ( ← )
// * 대입연산자 ( ← )
// * 컴마연산자 ( → )
// *  [제어문]  ****************************************
// * 선택문 (if-else, switch)
// * - 묵시적 순서 제어
// *   : 문장들을 위에서 아래로 순서적으로 실행
// * - 명시적 순서 제어
// *   : 조건을 평가한 후, 실행할 부분을 선택실행
// *   : 어떤 조건이 충족할 때까지 특정부분을 반복실행
// *   : 미리 지정된 문장으로 무조건 분기실행
// * - 조건 제어문
// *   : 양방향 분기 : if ~ else
// *   : 다방향 분기 : switch ~ case
// * - switch문
// *   : case label은 정수형(int, char)의 값만 사용
// *   : double형은 사용불가능
// *   : 문자열은 사용가능
// ****************************************************
// */