//public class week4 {
//}
///**
//정수형
//    word 크기
//    2진수 2의 보수
//실수형
//    double word 크기
//    e-표기방법
//        3.14 -> 0.314 * 10
//
//가수와 지수
//가수 : 0.314
//지수 : ^1
//
//char
//    byte
//    ASCⅡ
//        unicode
//
//Java의 3요소
//    keyword (49)
//    data (8)
//    operator
//
//사직연산자
//    +
//    -
//    *
//    /
//    %
//
//Operator{
//    연산자 구분{
//        산술 연산자
//            단항
//                ++a, a--, -a
//                1개의 자료에 대해 산술 연산
//            이항
//                a + b, a * b
//                2개의 자료에 대해 산술 연산
//            삼항
//                수식?참:거짓
//                max = (a > b) ? a : b;
//            대입
//                왼쪽 변수에 값을 대입
//
//        관계 연산자
//            대소, 등가 관계를 비교 ( (<, <=, >, >=) : 대소, (==, !=) :  동등)
//
//        논리 연산자
//            복수개의 조건을 평가 ( &&(AND) = *, ||(OR) = + : 이항 , !(NOT) : 단항)
//            Short-circuit evaluation
//                a && b
//                a = false일 경우 결과 값이 모두 false, a = true일 때만 평가 진행
//                a || b
//                a = true일 경우 결과 값이 모두 true, a = false일 때만 평가 진행
//
//        조건 연산자
//            조건 만족의 여부에 따라 별개의 값 계산
//
//        비트 연산자
//            비트 이동 연산자
//                비트 값을 좌우로 이동
//            비트 논리 연산자
//                비트 값에 대해 논리 연산
//
//        기타 연산자
//            형변환 연산자
//                자료형 변환
//            문자열 연산자
//                여러개의 문자열 결합
//
//        관계 논리 연산자 우선 순위
//        관계 > 논리
//            단항 연산자 (!(논리 NOT) > 비교 (<, <=. >, >=) > 등가(==,!=) > 논리 AND(%%) > 논리 OR(||)
//
//        강제 연산자 (cast 연산자)
//            int a = (int)5.5;
//            int a = (int)(5.5+5);
//    }
//}
//
//Expression{
//    단순 수식
//    복합 수식
//}
//
//Statement{
//    l-value = expression
//
//    형태의 분류{
//        단문
//        복문
//        공문
//    }
//
//    기능별 분류{
//        선언문
//        치환문, 대입문
//        제어문
//        함수문
//    }
// }
//
// 증가, 감소 연산자{
//    연산자  |  설  명  |   의   미   |    사  용  예
//        ++ | 1을 증가 | a = a + 1; | ++a;(후위 연산자) 또는 a++;(전위 연산자)
//        -- | 1을 감소 | a = a - 1; | --a; 또는 a--;
//        -  |부호 반전 | a = -a;    | -a
//        +  |  양수   | a = +9;    | +9
// }
//*/
